duxinglang-1/nRF9151_TEST/PD1_UK_NCS2.7.0_TEST/src/gps/gps.c
	if(nrf_modem_gnss_fix_retry_set(fix_retry) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS fix retry");
	#endif
		return -1;
	}

	if(nrf_modem_gnss_fix_interval_set(fix_interval) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS fix interval");
	#endif
		return -1;
	}

#if defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	k_work_schedule_for_queue(&gnss_work_q, &ttff_test_prepare_work, K_NO_WAIT);
#else /* !CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */
	if(nrf_modem_gnss_start() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to start GNSS");
	#endif
		return -1;
	}
#endif

	return 0;
}

static bool output_paused(void)
{
#if defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) || defined(CONFIG_GNSS_SAMPLE_LOG_LEVEL_OFF)
	return false;
#else
	return (requesting_assistance || assistance_is_active()) ? true : false;
#endif
}

static void print_satellite_stats(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	uint8_t tracked   = 0;
	uint8_t in_fix    = 0;
	uint8_t unhealthy = 0;

	for(int i = 0; i < NRF_MODEM_GNSS_MAX_SATELLITES; ++i)
	{
		if(pvt_data->sv[i].sv > 0)
		{
			tracked++;

			if(pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_USED_IN_FIX)
			{
				in_fix++;
			}

			if(pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_UNHEALTHY)
			{
				unhealthy++;
			}
		}
	}

#ifdef GPS_DEBUG
	LOGD("Tracking: %2d Using: %2d Unhealthy: %d\n", tracked, in_fix, unhealthy);
#endif
}

static void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
    uint8_t tmpbuf[256] = {0};

#ifdef GPS_DEBUG
    int32_t lon, lat;

    lon = pvt_data->longitude*1000000;
    lat = pvt_data->latitude*1000000;
    sprintf(tmpbuf, "Longitude:%d.%06d, Latitude:%d.%06d", lon/1000000, lon%1000000, lat/1000000, lat%1000000);
    LOGD("%s",tmpbuf);
	LOGD("Date:           %04u-%02u-%02u\n",
	       pvt_data->datetime.year,
	       pvt_data->datetime.month,
	       pvt_data->datetime.day);
	LOGD("Time (UTC):     %02u:%02u:%02u.%03u\n",
	       pvt_data->datetime.hour,
	       pvt_data->datetime.minute,
	       pvt_data->datetime.seconds,
	       pvt_data->datetime.ms);
#endif
}

static void gps_data_get_work_fn(struct k_work *item)
{
	ARG_UNUSED(item);

	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	for(;;)
	{
		(void)k_poll(events, 2, K_FOREVER);

		if(events[0].state == K_POLL_STATE_SEM_AVAILABLE 
			&& k_sem_take(events[0].sem, K_NO_WAIT) == 0)
		{
			/* New PVT data available */

			if(!IS_ENABLED(CONFIG_GNSS_SAMPLE_NMEA_ONLY))
			{
				//print_satellite_stats(&last_pvt);
			#ifdef GPS_DEBUG
				LOGD("pvt");
			#endif

				if(test_gps_flag)
				{
					uint8_t i,tracked = 0,flag = 0;
					uint8_t strbuf[256] = {0};
					int32_t lon,lat;
					
					memset(gps_test_info, 0x00, sizeof(gps_test_info));
					
					for(i=0;i<NRF_MODEM_GNSS_MAX_SATELLITES;i++)
					{
						uint8_t buf[256] = {0};
						
						if(last_pvt.sv[i].sv > 0)
						{
							tracked++;
						#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
							if(tracked<8)
							{
								if(flag == 0)
								{
									flag = 1;
									sprintf(buf, "%02d", last_pvt.sv[i].cn0/10);
								}
								else
								{
									sprintf(buf, "|%02d", last_pvt.sv[i].cn0/10);
								}
								
								strcat(strbuf, buf);
							}
						#else
						  #ifdef CONFIG_FACTORY_TEST_SUPPORT
							if(IsFTGPSTesting())
							{
								if(flag == 0)
								{
									flag = 1;
									sprintf(buf, "%02d", last_pvt.sv[i].cn0/10);
								}
								else
								{
									sprintf(buf, "|%02d", last_pvt.sv[i].cn0/10);
								}
							}
							else
						  #endif
							{
								if(flag == 0)
								{
									flag = 1;
									sprintf(buf, "%02d|%02d", last_pvt.sv[i].sv, last_pvt.sv[i].cn0/10);
								}
								else
								{
									sprintf(buf, ";%02d|%02d", last_pvt.sv[i].sv, last_pvt.sv[i].cn0/10);
								}
						  	}
							strcat(strbuf, buf);
						#endif
						}
					}
	
				#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
					sprintf(gps_test_info, "%02d,", tracked);
				#else
					sprintf(gps_test_info, "%02d\n", tracked);
				#endif
					strcat(gps_test_info, strbuf);

				#ifdef CONFIG_FACTORY_TEST_SUPPORT
					FTGPSStatusUpdate(false);
				#endif

					gps_test_update_flag = true;
				}

				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED)
				{
				#ifdef GPS_DEBUG
					LOGD("GNSS operation blocked by LTE");
				#endif
				}
				
				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME)
				{
				#ifdef GPS_DEBUG
					LOGD("Insufficient GNSS time windows");
				#endif
				}
				
				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT)
				{
				#ifdef GPS_DEBUG
					LOGD("Sleep period(s) between PVT notifications");
				#endif
				}

				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID)
				{
				#ifdef GPS_DEBUG
					LOGD("NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID");
				#endif

					if(gps_fix_time == 0)
					{
						gps_fix_time = k_uptime_get();
						gps_local_time = gps_fix_time-gps_start_time;
					}
		
					if(!test_gps_flag)
					{
					#ifdef GPS_DEBUG
						LOGD("Position fix with NMEA data, fix time:%d", gps_local_time);
					#endif
						APP_Ask_GPS_off();

						if(k_timer_remaining_get(&app_wait_gps_timer) > 0)
							k_timer_stop(&app_wait_gps_timer);

						k_timer_start(&app_send_gps_timer, K_MSEC(1000), K_NO_WAIT);
					}
					else
					{
						uint8_t strbuf[256] = {0};
						int32_t lon,lat;
						
					#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
						strcat(gps_test_info, "\n");	//2行没显示满，多换行一行
						if(gps_fix_time > 0)
						{
							sprintf(strbuf, "fix:%dS", gps_local_time/1000);
							strcat(gps_test_info, strbuf);
						}
					#else
						strcat(gps_test_info, "\n");
						
						lon = last_pvt.longitude*1000000;
						lat = last_pvt.latitude*1000000;
						sprintf(strbuf, "Lon:   %d.%06d\nLat:    %d.%06d\n", lon/1000000, abs(lon)%1000000, lat/1000000, abs(lat)%1000000);
						strcat(gps_test_info, strbuf);

