duxinglang-1/nRF9151_TEST/PD1_UK_NCS2.7.0_TEST/src/gps/gps.c
					#ifdef CONFIG_FACTORY_TEST_SUPPORT
						if(IsFTGPSTesting())
						{
							//xb add 2023-03-15 ft gps test don't need show fix time
						}
						else
					#endif
						{
							if(gps_fix_time > 0)
							{
								sprintf(strbuf, "fix time:    %dS", gps_local_time/1000);
								strcat(gps_test_info, strbuf);
							}
						}
					#endif

					#ifdef CONFIG_FACTORY_TEST_SUPPORT
						FTGPSStatusUpdate(true);
					#endif

						gps_test_update_flag = true;
					}
					
				#ifdef GPS_DEBUG
					print_fix_data(&last_pvt);
				#endif
				}
				else
				{
				#ifdef GPS_DEBUG
					LOGD("Seconds since last fix: %lld", (k_uptime_get() - gps_start_time) / 1000);
				#endif
					cnt++;
				#ifdef GPS_DEBUG
					LOGD("Searching [%c]", update_indicator[cnt%4]);
				#endif
				}
			}
		#if defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
			else
			{
				/* Calculate the time GNSS has been blocked by LTE. */
				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED)
				{
					time_blocked++;
				}
			}
		#endif/*CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST*/
		}
		if(events[1].state == K_POLL_STATE_MSGQ_DATA_AVAILABLE 
			&& k_msgq_get(events[1].msgq, &nmea_data, K_NO_WAIT) == 0)
		{
			/* New NMEA data available */
		#ifdef GPS_DEBUG
			LOGD("NMEA:%s", nmea_data->nmea_str);
		#endif

			k_free(nmea_data);
		}

		events[0].state = K_POLL_STATE_NOT_READY;
		events[1].state = K_POLL_STATE_NOT_READY;

		if(!gps_is_on)
			break;
	}
}

bool APP_GPS_data_send(bool fix_flag)
{
	bool ret = false;

#ifdef CONFIG_BLE_SUPPORT	
	if(ble_wait_gps)
	{
		APP_get_gps_data_reply(fix_flag, last_pvt);
		ble_wait_gps = false;
		ret = true;
	}
#endif

	if(sos_wait_gps)
	{
		sos_get_gps_data_reply(fix_flag, last_pvt);
		sos_wait_gps = false;
		ret = true;
	}

#if defined(CONFIG_IMU_SUPPORT)&&defined(CONFIG_FALL_DETECT_SUPPORT)
	if(fall_wait_gps)
	{
		fall_get_gps_data_reply(fix_flag, last_pvt);
		fall_wait_gps = false;
		ret = true;
	}
#endif

	if(location_wait_gps)
	{
		location_get_gps_data_reply(fix_flag, last_pvt);
		location_wait_gps = false;
		ret = true;
	}

	return ret;
}

void APP_Ask_GPS_Data_timerout(struct k_timer *timer)
{
	if(!test_gps_flag)
		gps_off_flag = true;

	gps_send_data_flag = true;
}

void APP_Ask_GPS_Data(void)
{
	static uint8_t time_init = false;

#if 1
	if(!gps_is_on)
	{
		gps_on_flag = true;
		k_timer_start(&app_wait_gps_timer, K_SECONDS(APP_WAIT_GPS_TIMEOUT), K_NO_WAIT);
	}
#else
	last_pvt.datetime.year = 2020;
	last_pvt.datetime.month = 11;
	last_pvt.datetime.day = 4;
	last_pvt.datetime.hour = 2;
	last_pvt.datetime.minute = 20;
	last_pvt.datetime.seconds = 40;
	last_pvt.longitude = 114.025254;
	last_pvt.latitude = 22.667808;
	gps_local_time = 1000;
	
	APP_Ask_GPS_Data_timerout(NULL);
#endif
}

void APP_Send_GPS_Data_timerout(struct k_timer *timer)
{
	gps_send_data_flag = true;
}

void APP_Ask_GPS_off(void)
{
	if(!test_gps_flag)
		gps_off_flag = true;
}

bool gps_is_working(void)
{
#ifdef GPS_DEBUG
	LOGD("gps_is_on:%d", gps_is_on);
#endif
	return gps_is_on;
}

void gps_turn_off(void)
{
#ifdef GPS_DEBUG
	LOGD("begin");
#endif

	nrf_modem_gnss_stop();
	gps_is_on = false;
}

void gps_off(void)
{
	if(!gps_is_on)
		return;

	gps_turn_off();
}

bool gps_turn_on(void)
{
	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	err = nrf_modem_lib_init();
	if(err)
	{
	#ifdef GPS_DEBUG
		LOGD("Modem library initialization failed, error: %d", err);
	#endif
		return false;
	}

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
		sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1)
	{
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if(modem_init() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to initialize modem");
	#endif
		return false;
	}

	if(sample_init() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to initialize sample");
	#endif
		return false;
	}

	if(gnss_init_and_start() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to initialize and start GNSS");
	#endif
		return false;
	}

	gps_is_on = true;
	gps_fix_time = 0;
	gps_local_time = 0;
	memset(&last_pvt, 0, sizeof(last_pvt));
	gps_start_time = k_uptime_get();
	
	k_work_submit_to_queue(app_work_q, &gps_data_get_work);

	return true;
}

void gps_on(void)
{
	bool ret = false;
	
	if(gps_is_on)
		return;
	
	ret = gps_turn_on();
#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(!ret)
	{
		FTGPSStartFail();
	}
#endif
}

void gps_test_update(void)
{
	//if(screen_id == SCREEN_ID_GPS_TEST)
	//	scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
}

void MenuStartGPS(void)
{
	test_gps_flag = true;
	gps_on_flag = true;
}

void MenuStopGPS(void)
{
	gps_off_flag = true;
}

#ifdef CONFIG_FACTORY_TEST_SUPPORT
void FTStartGPS(void)
{
	test_gps_flag = true;
	gps_on();
}

void FTStopGPS(void)
{
	gps_off();
}
#endif

void GPS_init(struct k_work_q *work_q)
{
	app_work_q = work_q;
	gps_work_init();
}

void GPSTestInit(void)
{
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_GPS, LTE_LC_SYSTEM_MODE_PREFER_AUTO);
}

void GPSTestUnInit(void)
{
#if IS_ENABLED(CONFIG_LTE_NETWORK_MODE_NBIOT_GPS)
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_NBIOT_GPS, LTE_LC_SYSTEM_MODE_PREFER_AUTO);
#elif IS_ENABLED(CONFIG_LTE_NETWORK_MODE_LTE_M_GPS)
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS, LTE_LC_SYSTEM_MODE_PREFER_AUTO);
#endif
}

void GPSMsgProcess(void)
{
	if(gps_on_flag)
	{
		gps_on_flag = false;
		if(test_gps_flag)
		{
			SetModemTurnOff();
			GPSTestInit();
			SetModemTurnOn();
		}
		gps_on();
	}
	
	if(gps_off_flag)
	{
		gps_off_flag = false;
		gps_off();
		if(test_gps_flag)
		{
			SetModemTurnOff();
			GPSTestUnInit();
			SetModemTurnOn();
			test_gps_flag = false;
		}
	}

	if(gps_send_data_flag)
	{
		gps_send_data_flag = false;
		if(gps_local_time > 0)
		{
			APP_GPS_data_send(true);
		}
		else
		{
			APP_GPS_data_send(false);
		}
	}
	
	if(gps_test_update_flag)
	{
		gps_test_update_flag = false;
		gps_test_update();
	}
	
	if(gps_is_on)
	{
		k_sleep(K_MSEC(5));
	}
}
